**`teams/nomis/rhel_7_9_baseimage`** terraform plan on `pull_request` event [#460](${url})

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_component.this["../components/rhel_7_9_baseimage/rhel_7_9_baseimage.yml.tftpl"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/rhel-7-9-baseimage/1.1.7/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: rhel_7_9_baseimage
            description: RHEL7.9 BaseImage provisioner component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: "1.1.7"
          +       default: "1.1.8"
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: UpdateOS
                    action: UpdateOS
            
                  - name: InstallPackages
                    action: ExecuteBash
                    inputs:
                      commands:
                        - sudo yum install wget curl unzip git nc ca-certificates gcc screen zlib-devel bzip2-devel openssl-devel libffi-devel  -y
            
                  - name: InstallPython3-9
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # install python 3.9
                          wget https://www.python.org/ftp/python/3.9.6/Python-3.9.6.tgz
                          tar xzf Python-3.9.6.tgz
                          rm -f Python-3.9.6.tgz
                          cd Python-3.9.6
            
                          # ensure zlib is enabled, required for some ansible modules
                          sed -i 's/^#zlib/zlib/' Modules/Setup
            
                          ./configure --enable-optimizations
                          sudo make altinstall
            
            
                  # Install node exporter agent with ansible roles
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          PATH=/usr/local/bin:$PATH
                          repo="modernisation-platform-ami-builds"
                          server_type="base"
            
                          # clone ansible roles and playbook
                          ansible_dir=$(mktemp -d)
          -               echo "Cloning $repo into $ansible_dir using branch=nomis/DSOS-1466/ec2-provisioning-strategy"
          +               echo "Cloning $repo into $ansible_dir using branch=main"
                          cd $ansible_dir
          -               git clone -b nomis/DSOS-1466/ec2-provisioning-strategy --single-branch "https://github.com/ministryofjustice/$repo.git"
          +               git clone -b main --single-branch "https://github.com/ministryofjustice/$repo.git"
            
                          # install python dependencies outside of virtual env so ansible
                          # can be executed remotely
                          cd $ansible_dir/$repo/ansible
                          python3.9 -m pip install -r requirements.txt
            
                          # install, create, activate virtual environment
                          mkdir -p /var/lib/venv && cd "$_"
                          python3.9 -m pip install virtualenv
                          python3.9 -m venv ansible-6.0.0
                          source ansible-6.0.0/bin/activate
            
                          # Install requirements in virtual env
                          cd $ansible_dir/$repo/ansible
                          python3.9 -m pip install --upgrade pip
                          python3.9 -m pip install ansible==6.0.0
                          python3.9 -m pip install -r $ansible_dir/modernisation-platform-ami-builds/ansible/requirements.txt
                          ansible-galaxy role install -r $ansible_dir/modernisation-platform-ami-builds/ansible/requirements.yml
                          ansible-galaxy collection install -r $ansible_dir/modernisation-platform-ami-builds/ansible/requirements.yml
            
                          # Get required extra vars and run ansible
                          PY_INTERPRETER=$(which python3.9)
                          ansible-playbook site.yml \
                          --connection=local \
                          --inventory localhost \
                          --extra-vars "target=localhost" \
                          --extra-vars "ansible_python_interpreter=$PY_INTERPRETER" \
                          --extra-vars "@group_vars/server_type_$server_type.yml" \
                          --become
            
                          # Cleanup (keep ansible virtualenv as it will be used regularly)
                          deactivate
                          echo "Cleaning up $ansible_dir"
                          rm -rf $ansible_dir/$repo
                          rmdir $ansible_dir
        EOT
      ~ date_created          = "2022-09-20T09:49:28.641Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/rhel-7-9-baseimage/1.1.7/1" -> (known after apply)
        name                  = "rhel_7_9_baseimage"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "1.1.7" -> "1.1.8" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-7-9-baseimage"
        name         = "nomis_rhel_7_9_baseimage"
      ~ tags         = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-7-9-baseimage" -> (known after apply)
      ~ date_created                     = "2022-09-20T09:49:34.537Z" -> (known after apply)
      ~ date_last_run                    = "2022-09-20T09:50:42.745Z" -> (known after apply)
      ~ date_next_run                    = "2022-10-01T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2022-09-20T09:49:34.537Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-7-9-baseimage" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.3.1" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-3-1" -> (known after apply)
        name                             = "nomis_rhel_7_9_baseimage"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)


      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.3.1" -> (known after apply)
      ~ date_created     = "2022-09-20T09:49:32.880Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.3.1" -> (known after apply)
        name             = "nomis_rhel_7_9_baseimage"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "1.3.1" -> "1.3.2" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/rhel-7-9-baseimage/1.1.7/1" -> (known after apply) # forces replacement
        }

        # (5 unchanged blocks hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-3-1" -> (known after apply)
      ~ date_created                  = "2022-09-20T09:49:28.975Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-3-1" -> (known after apply)
      ~ name                          = "nomis_rhel_7_9_baseimage_1_3_1" -> "nomis_rhel_7_9_baseimage_1_3_2" # forces replacement
      ~ resource_tags                 = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "branch"                                = "nomis/DSOS-1466/ec2-provisioning-strategy" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.3.1" -> "nomis_rhel_7_9_baseimage/1.3.2"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.7" -> "1.1.8"
            # (12 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on ../modules/imagebuilder/versions.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

```